backend/controllers/FreedemoController.php

SELECT * FROM `freedemo` WHERE (`email` LIKE '%wah%') OR (`description` LIKE '%wah%')
---
    public function actionLiveSearch($searchQuery = null)
    {
        Yii::$app->response->format = \yii\web\Response::FORMAT_JSON;

        if ($searchQuery !== null) {
            $models = Freedemo::find()
                ->where(['like', 'email', $searchQuery])
                ->orWhere(['like', 'description', $searchQuery])
                ->all();

SELECT * FROM `freedemo`
---
    public function actionViewFreedemo()
    {
        if ( Yii::$app->user->can( '/messages/view' ) ) {
        // Fetch all Freedemo
        $models = Freedemo::find()->all();

SELECT * FROM `freedemo` WHERE `serialNumber`='280'
---
    public function actionViewFreedemoDetails($serialNumber)
    {
        // Fetch the contact record to ensure it exists
        $model = Freedemo::findOne($serialNumber);